import React from "react";
import TermsAndConditionsHeader from "../../components/termsAndConditions/header";
const TermsAndConditionsPage = () => {
  return (
    <div className="min-h-screen bg-white">
      <TermsAndConditionsHeader />
      <div className="p-4 pt-28 text-right leading-relaxed text-gray-800">
        {/* Placeholder for policy text */}
        {/* <p>
          الشروط وا لأحكام لمنصة "لا باس"￼ القسم ا لأول: التعاريف لضمان وضوح ا
          لاتفاقية وتفادي أي لبس، تُعرف ا لمصطلحات التالية كما هو مبين أدناه: -
          "لا باس"، "ا لمنصة"، "ا لموقع": تشير إلى ا لموقع الإلكتروني ]أدخل
          الرابط هنا[، بما في ذلك جميع الصفحات الفرعية، التطبيقات ا لم رتبطة،
          والخدمات ا لمتاحة عبر هذه ا لمنصة. - "الشركة"، "نحن": تعني "لا باس"،
          وهي كيان قانوني مسجل في ا لمملكة العربية السعودية بإسم )شركة معالم
          التطوير لتقنية المعلومات شركة شخص واحد( ورقم سجل تجاري )1010708852( -
          "المحتوى": يشمل هذا المصطلح جميع أنواع المواد المتاحة للمستخدمين عبر
          المنصة، بما في ذلك، لكن لا تقتصر على، النصوص، الصور، مقاطع الفيديو،
          الرسومات، وا لأدوات التفاعلية،. - "الخدمات": تشير إلى جميع الخدمات
          التي تقدمها "لا باس"، سواء كانت مجانية أو تتطلب اشترا ًكا أو رسو ًما
          للوصول. - "الخدمات ا لمدفوعة": تعبر عن الخدمات التي تتطلب من ا
          لمستخدمين دفع رسوم محددة للوصول إلى محتوى أو خدمات خاصة. - "ا
          لمستخدم"، "أنت": يعني أي شخص يقوم بالوصول إلى ا لمنصة واستخدام الخدمات
          التي تقدمها "لا باس". القسم الثاني: ا لمقدمة والنطاق 2.1 نظرة عامة على
          "لا باس": "لا باس" تسعى لتوفير بيئة ديناميكية تتيح الوصول إلى موارد
          وخدمات مصممة خصي ًصا لتعزيز الصحة وجودة الحياة والرفاهية. ُيشددعلىأنا
          لمنصةلاتهدفإلىاستبدالا لاستشارةالطبيةأوالع لاجالطبي. 2.2 **التحديثات
          والتعديلات**: "لا باس" تحتفظ بالحق في تعديل هذه الاتفاقية وأي سياسات
          مرتبطة بها في أي وقت. يعتبر استمرار استخدامك للمنصة بمثابة قبولك لهذه
          التغييرات. القسم الثالث: شروط الاستخدام 3.1 الاستخدام القانوني وا
          لمسؤول: ُيطلب من المستخدمين الالتزام بالقوانين المحلية والدولية عند
          استخدام المنصة والخدمات، وتجنب أي سلوكيات قد تعرض ا لمنصة أو مستخدمين
          آخرين للخطر. 3.2 الخصوصية وا لأمان: تلتزم "لا باس" بحماية خصوصية ا
          لمستخدمين وأمان بياناتهم. على المستخدمين اتخاذ الإجراءات اللا زمة
          لحماية معلومات حسابهم والإبلاغ عن أي أنشطة مشبوهة. القسم الرابع: حقوق
          الملكية الفكرية تُعتبر جميع ا لمواد والخدمات ا لمقدمة عبر "لا باس"،
          بما في ذلك النصوص، الصور، الفيديوهات، وغيرها من ا لمحتويات، محمية
          بموجب قوانين حقوق ا لملكية الفكرية السارية. القسم الخامس: التعويض
          باستخدامك للمنصة، توافق على تعويض "لا باس" وحمايتها من أي مطالبات أو
          خسائر قد تنشأ عن استخدامك غير القانوني أو ا لمخالف للشروط وا لأحكام.
          القسم السادس: ا لإخ لاء من ا لمسؤولية "لا باس" تقدم خدمة ربط مقدم
          الخدمات مع طالب الخدمة، ولا تتحمل مسؤوليتها عن أي ضرر قد ينجم من هذه
          الع لاقة او خطأ ناجم من ا لممارس الصحي. القسم السابع: التحكيم يتم حل
          أي نزاعات تنشأ بين ا لمستخدمين و"لا باس" من خ لال التحكيم الودي، كخطوة
          أولية قبل اللجوء إلى ا لإجراءات القانونية.￼ القسم الثامن: حقوق النشر
          وا لاستخدام ا لمصرح به ُيمنع إعادة نشر أو استخدام ا لمحتوى ا لمقدم عبر
          "لا باس" بدون الحصول على موافقة خطية مسبقة، مع ا لالتزام بقوانين حقوق
          النشر ا لمحلية. القسم التاسع: الخصوصية وحماية البيانات
        </p>
        لاباس"تلتزم بحماية خصوصيةا لمستخدمين وتأمين بياناتهم
        الشخصية،وفًقالسياسةالخصوصيةالمنشورةعلى الموقع. القسم العاشر: الإنهاء
        والتعليق تحتفظ "لا باس" بالحق في إنهاء أو تعليق حساب أي مستخدم يخالف هذه
        الشروط وا لأحكام، مع الإشارة إلى عواقب هذا ا لإجراء. خاتمة هذه الشروط وا
        لأحكام تشكل ا لاتفاقية الكاملة بين ا لمستخدمين و"لا باس". باستخدام
        المنصة، تقر وتوافق على ا لالتزام بما ورد فيها. نوصي بمراجعة هذه الوثيقة
        بانتظام لمتابعة أية تحديثات.
        <p></p> */}
      </div>
    </div>
  );
};

export default TermsAndConditionsPage;
