import React from "react";
import Header from "../../../components/common/header";

const TermsAndConditionsPage = () => {
  return (
    <div className="min-h-screen bg-white">
      <Header title="الشروط والأحكام" showBackButton />
      <div className="p-4 pt-28 text-right leading-relaxed text-gray-800">
        {/* Placeholder for policy text */}
        <p dir="rtl">
          الشروط وا لأحكام لمنصة &quot;لا باس&quot; القسم ا لأول: التعاريف لضمان
          وضوح ا لاتفاقية وتفادي أي لبس، تُعرف ا لمصطلحات التالية كما هو مبين
          أدناه: - &quot;لا باس&quot;، &quot;ا لمنصة&quot;، &quot;ا لموقع&quot;:
          تشير إلى ا لموقع الإلكتروني الرابط هنا، بما في ذلك جميع الصفحات
          الفرعية، التطبيقات ا لم رتبطة، والخدمات ا لمتاحة عبر هذه ا لمنصة. -
          &quot;الشركة&quot;، &quot;نحن&quot;: تعني &quot;لا باس&quot;، وهي كيان
          قانوني مسجل في ا لمملكة العربية السعودية بإسم شركة معالم التطوير
          التطوير لتقنية المعلومات شركة شخص واحدورقم سجل تجاري 1010708852 -
          &quot;المحتوى&quot;: يشمل هذا المصطلح جميع أنواع المواد المتاحة
          للمستخدمين عبر المنصة، بما في ذلك، لكن لا تقتصر على، النصوص، الصور،
          مقاطع الفيديو، الرسومات، وا لأدوات التفاعلية،. - &quot;الخدمات&quot;:
          تشير إلى جميع الخدمات التي تقدمها &quot;لا باس&quot;، سواء كانت مجانية
          أو تتطلب اشترا ًكا أو رسو ًما للوصول. - &quot;الخدمات ا لمدفوعة&quot;:
          تعبر عن الخدمات التي تتطلب من ا لمستخدمين دفع رسوم محددة للوصول إلى
          محتوى أو خدمات خاصة. - &quot;ا لمستخدم&quot;، &quot;أنت&quot;: يعني أي
          شخص يقوم بالوصول إلى ا لمنصة واستخدام الخدمات التي تقدمها &quot;لا
          باس&quot;. القسم الثاني: ا لمقدمة والنطاق 2.1 نظرة عامة على &quot;لا
          باس&quot;: &quot;لا باس&quot; تسعى لتوفير بيئة ديناميكية تتيح الوصول
          إلى موارد وخدمات مصممة خصي ًصا لتعزيز الصحة وجودة الحياة والرفاهية.
          ُيشددعلىأنا لمنصةلاتهدفإلىاستبدالا لاستشارةالطبيةأوالع لاجالطبي. 2.2
          **التحديثات والتعديلات**: &quot;لا باس&quot; تحتفظ بالحق في تعديل هذه
          الاتفاقية وأي سياسات مرتبطة بها في أي وقت. يعتبر استمرار استخدامك
          للمنصة بمثابة قبولك لهذه التغييرات. القسم الثالث: شروط الاستخدام 3.1
          الاستخدام القانوني وا لمسؤول: ُيطلب من المستخدمين الالتزام بالقوانين
          المحلية والدولية عند استخدام المنصة والخدمات، وتجنب أي سلوكيات قد تعرض
          ا لمنصة أو مستخدمين آخرين للخطر. 3.2 الخصوصية وا لأمان: تلتزم &quot;لا
          باس&quot; بحماية خصوصية ا لمستخدمين وأمان بياناتهم. على المستخدمين
          اتخاذ الإجراءات اللا زمة لحماية معلومات حسابهم والإبلاغ عن أي أنشطة
          مشبوهة. القسم الرابع: حقوق الملكية الفكرية تُعتبر جميع ا لمواد
          والخدمات ا لمقدمة عبر &quot;لا باس&quot;، بما في ذلك النصوص، الصور،
          الفيديوهات، وغيرها من ا لمحتويات، محمية بموجب قوانين حقوق ا لملكية
          الفكرية السارية. القسم الخامس: التعويض باستخدامك للمنصة، توافق على
          تعويض &quot;لا باس&quot; وحمايتها من أي مطالبات أو خسائر قد تنشأ عن
          استخدامك غير القانوني أو ا لمخالف للشروط وا لأحكام. القسم السادس: ا
          لإخ لاء من ا لمسؤولية &quot;لا باس&quot; تقدم خدمة ربط مقدم الخدمات مع
          طالب الخدمة، ولا تتحمل مسؤوليتها عن أي ضرر قد ينجم من هذه الع لاقة او
          خطأ ناجم من ا لممارس الصحي. القسم السابع: التحكيم يتم حل أي نزاعات
          تنشأ بين ا لمستخدمين و&quot;لا باس&quot; من خ لال التحكيم الودي، كخطوة
          أولية قبل اللجوء إلى ا لإجراءات القانونية.￼ القسم الثامن: حقوق النشر
          وا لاستخدام ا لمصرح به ُيمنع إعادة نشر أو استخدام ا لمحتوى ا لمقدم عبر
          &quot;لا باس&quot; بدون الحصول على موافقة خطية مسبقة، مع ا لالتزام
          بقوانين حقوق النشر ا لمحلية. القسم التاسع: الخصوصية وحماية البيانات
        </p>
        لاباس&quot;تلتزم بحماية خصوصيةا لمستخدمين وتأمين بياناتهم
        الشخصية،وفًقالسياسةالخصوصيةالمنشورةعلى الموقع. القسم العاشر: الإنهاء
        والتعليق تحتفظ &quot;لا باس&quot; بالحق في إنهاء أو تعليق حساب أي مستخدم
        يخالف هذه الشروط وا لأحكام، مع الإشارة إلى عواقب هذا ا لإجراء. خاتمة هذه
        الشروط وا لأحكام تشكل ا لاتفاقية الكاملة بين ا لمستخدمين و&quot;لا
        باس&quot;. باستخدام المنصة، تقر وتوافق على ا لالتزام بما ورد فيها. نوصي
        بمراجعة هذه الوثيقة بانتظام لمتابعة أية تحديثات.
        <p></p>
      </div>
    </div>
  );
};

export default TermsAndConditionsPage;
