import React from "react";
import PrivacyPolicyHeader from "../../../components/privacePolicy/header";

const PrivacyPage = () => {
  return (
    <div className="min-h-screen bg-white">
      <PrivacyPolicyHeader />
      <div className="p-4 pt-28 text-right leading-relaxed text-gray-800">
        {/* Placeholder for policy text */}
        <p dir="rtl">
          سياسة الخصوصية￼ **ا لاستشارات  الخاصة بكم:** في &quot;لا باس&quot;، نقدم خدمة
          فريدة تسمح لكم بالتواصل ا لمباشر مع ا لأطباء عبر مكا لمات هاتفية خاصة،
          مما يضمن لكم الحصول على الرعاية ا لمثلى. خ لال هذه ا لاستشارات، يتم
          تبادل بياناتكم الشخصية والطبية بأمان تام مع الطبيب ا لمعالج، حيث
          نستخدم أحدث التقنيات لضمان أمان وسرية هذه ا لمعلومات. **التزامنا بسرية
          معلوماتكم:** نحن في &quot;لا باس&quot; نقدر خصوصيتكم ونلتزم بحماية بياناتكم
          الشخصية والطبية. نضمن عدم الكشف عن أي معلومات قد تحدد هويتكم لأطراف
          ثالثة، ونحافظ على سرية ا لمعلومات في جميع ا لأوقات، بما في ذلك خ لال ا
          لمكا لمات الهاتفية. **معايير الخصوصية ا لمتقدمة:** 1. **أمان وخصوصية
          بياناتكم في &quot;لا باس&quot;:** نضع خصوصيتكم وأمان بياناتكم في صميم أولوياتنا.
          لدينا سياسة خصوصية واضحة وشاملة تجيب عن ا لأسئلة الشائعة حول خدماتنا،
          كيفية حماية بياناتكم، وا لاستخدام ا لأمثل لها. نحن ملتزمون با لالتزام
          بالقوانين وا لمعايير لضمان الحماية الكاملة لمعلوماتكم. 2. **ا لأمان
          الرقمي في &quot;لا باس&quot;:** نستخدم أحدث التقنيات والبروتوكولات ا لأمنية
          لحماية بياناتكم، لضمان الحفاظ على خصوصيتكم وأمان معلوماتكم الشخصية
          والطبية. 3. **حماية بياناتكم داخل ا لمملكة العربية السعودية:** نؤكد
          على التزامنا بتخزين ومعالجة جميع بياناتكم داخل الحدود الجغرافية
          للمملكة العربية السعودية، مما يعزز من مستوى ا لأمان والخصوصية وف ًقا
          للقوانين والتشريعات ا لمحلية. **حقوق ا لمستخدم والشفافية:** تتيح لك
          سياسة الخصوصية التحكم الكامل في بياناتك. يمكنك في أي وقت الوصول إلى
          بياناتك الصحية، تعديلها، أو حذفها من سجلك الشخصي. نوفر تفاصيل دقيقة
          حول البيانات التي نجمعها وكيفية استخدامها، مع الحفاظ على التزامنا
          بالشفافية
        </p>
      </div>
    </div>
  );
};

export default PrivacyPage;
